{"256361636188698521397028321337896574465": {"I bought it, when we got my house built last month.": ["I bought it when we got my house built last month."], "It was one of my wish lists, as my hands got chapped from detergent.": ["It was an item on my wish list, as my hands got chapped from detergent."], "After using it, I realize that it is much more cleaner than washing by hands, and what’s more, I can reduce the time I spent doing washes.": ["After using it, I realize that it got the dishes much morecleaner than washing by hand and what’s more, I can reduce the time I spent doing washes."], "My mother told me that she doesn’t need to buy it, because at first, she likes to doing washes.": ["My mother told me that she doesn’t need to buy one, because, first of all, she likes to doing washes.", "My mother told me that she doesn’t need to buy, because first, she likes to do the dishes."], "Second, it’s much faster if she does washes by herself.": ["Second, it’s much faster if she does the washing by herself.", "Second, it’s much faster if she does the dishes by hand."], "I came across an article the other day and they say doing washes is of good importance to remove your stresses.": ["I came across an article the other day saying that dish washing is useful for removing your stresses."], "But for me, doing washes is just an unpleasant job to give me a lot of band-aid.": ["But for me, dish washing is just an unpleasant job to give me a lot of band-aid.**"]}, "66790772351198343205338104156873537443": {"I went to see my old friends from college .": ["I went to see my old friends from college."], "I’m not good at driving , so I avoided using high way.": ["I’m not good at driving, so I avoided using a freeway.", "I’m not good at driving , so I avoided using a  freeway."], "It ended up taking more than 2hours to get there.": ["It ended up taking more than two hours to get there.", "It  took me more than 2hours to get there."], "After we both got married and had own family, we gradually stop keeping touch than before, because of hectic life.": ["Since we both got married and had our own families, we haven't kept touch with each other as often as before, because of our hectic life.", "After we both got married and had our own families, we gradually stopped keeping in touch with each other , because of our hectic life."], "I think that real friend is the ones who can always there for you no matter where you are .": ["I think that real friend are the ones who can always there for you no matter where you are.", "I think that real friends are  the ones who can always be there for you no matter where you are ."], "I am happy to have friends and I want to treasure the ones I have now.": ["I am happy to have friends and I want to treasure them all the time."], "We haven’t seen for a long time, but we really had a good time as if we got back into old days.": ["We haven’t seen each other for a long time, but we really had a good time as if we got back into old days."]}, "26925720514685372472697671054459123619": {}, "15315532881855258548031902035305937411": {"Books give us not only for many useful information but leading to an exciting world.": ["Books not only give us a lot of useful information but lead to different exciting worlds.", "Books not only give us  a lot ofuseful information but also lead us to an exciting world."], "If you like to change your life for the better quickly without spending too much, I believe reading  books is the best way.": ["If you like to change your life better quickly without spending too much time or money, I believe reading books is the best way.", "If you  want to improve your life  quickly and without spending too much, I believe reading books is the best way."], "When you are in trouble, books will help you from most of things.": ["When you are in trouble, books will help you with most of your trouble.", "When you are in trouble, books can save  you in most cases ."], "The more you read , The more you broaden your horizon in that you can see different prospective.": ["The more books you read, the more you broaden your horizon in that you can see different prospective.", "The more you read , the more you broaden your horizon  so that you can see different views ."], "That is a power of reading.": ["That is the power of reading.", "That is  the power of reading."], "By the way I’m an English learner so I would like to read Harry Potter in English since I’ve always dreamed of reading it.": ["By the way, I’m an English learner so I would like to read Harry Potter in English, which is the dream that I’ve always had.", "By the way, I’m an English learner, so I would like to read Harry Potter in English since I’ve always dreamed of reading it."], "I didn’t use to like to read but now I love to read books.": ["I didn’t use to like to read, but now I love to read books."]}, "108212644102131691452826825631334775299": {"The meaning of the word “Output “is to get the knowledge you've learned ,and then talk, spread that .": ["The meaning of the word “Output “is to use the knowledge you've learned, such as speaking."], "An Japanese English teacher told me the word of “output “ is not quite right English, because the word is made from Japanese, but an African English teacher told me before, the word of “output” is used worldwide .": ["A Japanese English teacher told me the word “output “ is not quite right in English, because the word comes from Japanese, but an African English teacher told me before that the word “output” is used worldwide ."], "Who do you think the answer is right?": ["Whose answer do you think is right?"], "When it comes to English learning,I’ve heard of the word so many times recently.": ["While learning English, I’ve heard of the word so many times recently."], "In my English study, it’s obvious that input study such as reading, listening, are occupied mostly,compared to input study since I don’t speak English except that I speak to myself .": ["In my English study, it’s obvious that input study such as reading, listening, are occupied mostly,compared to input study since I don’t speak English except that I speak to myself ."], "I happened to find an article said that the best balance of input and output is 3to7.": ["I happened to find an article which said that the best balance of input and output is 3to7."], "It means I need to make a effort to increase a output study.": ["It means I need to make efforts to increase my output study."]}, "73927908420361877026438805040786028451": {"I have been suffering from stiff neck and shoulders.": ["I have been suffering from a stiff neck and shoulders.", "I have been suffering from a stiff neck and shoulders.", "I've been suffering from a stiff neck and shoulders, which also causes headaches."], "It also causes headache.": ["It also causes a headache.", "It also causes a headache.", "It causes a headache too."], "Here is my this month’s goal , First, I do radio exercise early  in the morning .": ["Here are what I want to keep doing this month. First, I do radio exercise early in the morning .", "Here is my this month’s goal. First, I do radio exercise early in the morning.", "This month’s goal: First, radio exercise early in the morning."], "Finally,I do  stretch my body and do sit-ups up and push-ups each twenty times before going to bed.": ["Finally, I stretch my body and do sit-ups up and push-ups each twenty times before going to bed.", "Finally, I do stretch my body and do sit-ups up and push-ups each twenty times each before going to bed.", "Finally, do stretches and then sit-ups and push-ups twenty times each before bed."], "I’d like to take a little step until it becomes to come to my habit.": ["I’d like to make a little more effort than usual until they all become to my habit.", "I’d like to take a little step until it becomes a to come to my habit.", "I’d like to take little steps until it becomes a habit."], "I think it’s important for me to keep on doing exercise every day.": ["I think it’s important for me to keep (on) doing some exercises every day.", "I think it’s important for me to keep on doing exercise every day.", "I think it’s important (for me) to keep exercising daily."], "To improve my health helps me to increase the quality of life as well.": ["Improving my health helps me increase the quality of my life as well.", "Improving my health helps me to increase my quality of life as well.", "Improving my health will help increase my quality of life as well."], "I hope to live a more healthy and happy life.": ["I hope I'll have a healthier and happier life.", "I hope to live a more healthy and happy life.", "I hope to live a more healthy, happy life."], "I’ve also lost my muscle as I I haven’t worked out recently.": ["I’ve also lost my muscle tone as I haven’t worked out recently.", "I've also lost muscle tone, as I haven’t worked out recently."], "I decided to try to get some exercises every day.": ["I decided to try to get some exercise every day.", "I decided to try to exercise every day."], "Second, I do step training for at least 10 minutes after lunch.": ["Second, step training for at least 10 minutes after lunch."]}, "289379293448979329064073272001689926147": {"November is my favorite month of the year.": ["November is my favorite monthof the year."], "We say fall is the best seasons for eating and reading.": ["We say fall is the best season for eating and reading."], "The view which the trees turn yellow are amazing,  and we enjoy to leaf peeping as well.": ["The view which the trees turn yellow are amazing, and we enjoy viewing autumn colors as well."], "While I was feeling fall in the air, I browsed at the store the other day and then I saw many schedule planner display.": ["While I was feeling fall in the air, I browsed around the store the other day and then I saw many schedule planners were displayed."], "As I saw, I imagined some fun events for next year and I am excited to what is going on .": ["When I saw them, I imagined some fun events for next year and I got excited to think of what would be going on ."], "actually I am the person who never use schedule planner because I like to write down so many memo and like to use original notebooks better .": ["Actually I never use schedule planners because I like to write down so many memos and like to use normal notebooks better ."], "In this digital ages,  I am wondering how many people still use schedule planners which made from paper .": ["In this digital age, I am wondering how many people still use schedule planners whichmade from paper."]}, "289084686853797097687930179260295526915": {"I went to a garbage incineration plant last Sunday so as  to throw our old furniture away.": ["I went to a garbage incineration plant last Sunday so as to throw our old furniture away."], "Surprisingly, when we arrived, many people had already lined up.": ["Surprisingly, when we arrived, many people had already lined up."], "It ended up taking three times as long as than we expected.": ["It ended up taking three times as long as than we expected."], "I realized that throwing away is required for taking some time and effort.": ["I realized that throwing away is required for taking some time and effort."], "So we might able to live simple life and to take good care of things what we really need .": ["So we might be able to live a simple life and to take good care of things that we really need."]}, "210279654542028363666303976103231207939": {"Literally, There are not any space to stand.": ["Literally, there isn't any space to stand."], "I'm on may way to preparing for moving.": ["I'm in the middle of preparing for moving out."], "I never thought that moving was so tough.": ["I had never thought that moving would be so tough."], "At the same time, I was so surprised that I had so many things which I have to disposal.": ["At the same time, I was so surprised that I had so many things which/that I had to dispose of/throw away."], "Some furniture has no choice to throw away, which cannot bring to new house.": ["Some furniture has no choice to throw away, which cannot bring it to our new house."], "Most book I may never read, so I decided to bring them to the library to contribute.": ["I may never read most of my books, so I decided to contribute them to the library.", "I have many  books that I may never read, so I decided to contribute  them to a library ."], "I found it is easy to buy  but it is more difficult  to dispose.": ["I found it is easy to buy but it is more difficult to throw away.", "I realized that  it is easy to buy (things?), but it is more difficult to  throw them away."], "I should have bought more careful when I bought things.": ["I should have thought more carefully when I bought those things."], "My house has a plenty of cardboard boxes right now.": ["My house is full  of cardboard boxes right now."]}, "86761333878304985293229014829319829411": {"I failed pre-1Eiken exam twice in a row.": ["I failed the pre-1 Eiken exam twice in a row."], "I was feeling that I would failed it ": ["I was feeling like I would fail it "], "because my writing was a disaster, which misunderstood the main point.": ["because my writing was a disaster, in which I misunderstood the main point."], "what's worse, in terms of vocabulary , I couldn't answer right , though I thought it was mostly fine.": ["What's worse, in terms of vocabulary, I couldn't answer right, though I thought it was mostly fine."], "I still didn't know why I made mistake so many questions.": ["I still didn't know why I got so many questionswrong."], "Honestly, It was apparent I wasn't enough better of my ability.": ["Honestly, it was apparent I wasn't improvingenough."], "It was the first time since I started to study in earnest.": ["It was the first time I failed an exam since I started to study in earnest."], "I just took some nice sleep and watch movie and cook for my family during a week.": ["I just slept in, watched movies, and cooked for my family for a week."], "now I am ready to study again.": ["Now I am ready to study again."], "First, I complimented for my trying, I have been studying hard.": ["First, I complimented myselffor my effort, I have been studying hard."], "I only failed the exam, I have an another chance to pass.": ["I only failed the examtwice, I have another chance to pass."], "I will keep on studying to receive my goal no matter what.": ["I will keep on studying to achieve my goal no matter what."]}, "101458756511854233103985034296152268289": {"More and more people are living hectic life, so if we get knowledge of how to use time efficiently, we would spend more productive thing such as reading books , relaxing at home, or doing exercise.": ["More and more people are living hectic lives, so if we learn of how to use time efficiently, we would spend it more productively by doing things, such as reading books, relaxing at home, or doing exercise."], "The book give us many ideas to save time.": ["The book give us many ideas on how to save time."], "One thing that I would like to try is to separate from what you need to do and what you don't need to do.": ["One thing that I would like to try is to separate what I need to do from what I don't (need to do)."], "In another word, to make not to do list.": ["In another words, to make a to-do list."], "Firstly I thought I should start to know what I am doing every day.": ["First, I thought I should start to know what I am doing every day."], "Then make prioritize what I want to do.": ["Then prioritize what I want to do."], "I'll just keep in mind these tips are great , but what I make an action is the most important.": ["Keeping these tips in mind is great, but actions are more important. /Keeping these tips in mind is great, but doing is better than just thinking."]}, "203860010446665114081520125991571928995": {"I'm recently into Harry Potter.": ["I'm recently into Harry Potter.", "Recently, I've been into Harry Potter."], "I've read them once when I was a child, but when I started to reread , I'm finding that I did not remember the whole story at all.": ["I've read the series once when I was a child, but when I started to reread them, I found that I did not remember the whole story at all.", "I once read them when I was a child, but since I started reading them again, I realized that I did not remember the whole story at all."], "It looks like I was not interested in it before .": ["It seems like I was not interested in it before."], "I may have read them because it was just best-sellers.": ["I may have read them because they were just best-sellers."], "anyway It was about twenty years ago.": ["Anyway, that was about twenty years ago."], "Time surely fries.": ["Time surely flies."], "Speaking of which, I've thought Harry Potter was books for children, But I realized that the more I read ,the more I become to be attractive by the books.": ["Speaking of which, I had thought Harry Potter books were for children, But I realized that the more I read, the more I became attracted by the books.", "Speaking of which, I had thought Harry Potter books were for children, but I realized that the more I read, the more attractive they become to me."], "The story and the characters are outstanding , not to mention the movie set such as outfits and prop .": ["The story and the characters are outstanding, not to mention the movie sets, outfits and props."], "A lot of people thinks Harry Potter is just fantasy story, but actually it is not only for that but also educate us for courage  and friendship and so on.": ["A lot of people think Harry Potter is just fantasy stories, but actually it is not only for that but they also educate us in terms of courage, friendship and so on.", "A lot of people thinks Harry Potter is just fantasy story, but actually it is not only for that but also educate us about the importance of courage, friendship and so on."]}, "9824360292744538930648547903961544611": {"It has been a long time that we eat out for lunch together just only us since we had a daughter.": ["We ate out for lunch together by ourselves for the first time since we had a daughter."], "We were seated next to window and it had a beautiful view.": ["We were seated next to the window and it had a beautiful view."], "We enjoyed a good meal while seeing cute swimming birds on the lake.": ["We enjoyed a good meal while seeing cute birds swimming on the lake."]}, "272270008827710797554997709641524682241": {"I saw it on the news that Ireland's Supreme Court has ruled subway's  bread is not bread": ["I saw on the news that Ireland's Supreme Court has ruled Subway's bread is not bread"], "The main point is about  what subway's bread should impose Value-Added Tax Act or not.": ["The main point is about whether or not Subway's bread should have the Value-Added Tax Act imposed on it or not."], "They made a decision because the bread sold by subway has too much sugar in it to be called bread.": ["They made a decision because the bread sold by Subway has too much sugar in it to be called bread."], "It is said that the definition of bread is less than 2% of sugar contain.": ["It is said that to be defined as bread, it must contain less than 2% sugar."], "I did not know it until now and never thought of it.": ["I did not know that until now and never thought of it."], "But if it is right , how should we call the subway's bread ?": ["But if it is right, what should we call Subway's \"bread\"?"], "From now on , The chances are people will have to be described it as \"something like bread \" ?": ["From now on, do you think that chances are people will have to describe it as \"something like bread\"?"]}, "209622523639742916450468077609485580195": {"I came across a fuss-free cookie recipe which made of hotcake mix the other day.": ["I came across a fuss-free cookie recipe which  usedhotcake mix the other day."], "This was my first time to try to bake it.": ["This was my first time trying to bake it."], "It ended up too swell to be called cookie as I expected.": ["It ended up bigger than what I would call a cookie."], "It tasted just as it was.": ["It tasted just as it was. like hotcake mix."], "The only good thing what I found was it was  simple and easy to make.": ["The only good thing about it was it was simple and easy to make."], "But Kate smiled and ate happily because she was able to cook them herself.": ["But Kate smiled and ate the cookies happily because she was able to cook them herself."]}, "144091741491648197908723994565252200355": {"I went for a walk with my daughter who rides on a tricycle early in the morning.": ["I went for a walk with my daughter, who rides on a tricycle early, in the morning.", "I went for a walk with my daughter, who was riding on a tricycle, early in the morning."], "It was a bit hot even it autumn came around.": ["It was a bit hot even though autumn has come around."], "we stopped by a supermarket and bought ice-cream.": ["We stopped by a supermarket and bought ice cream."], "It did not allow us to eat it on all tables, so we had no choice but to eat it outside.": ["They did not allow us to eat at the tables, so we had no choice but to eat it outside."]}, "173820573133975343443703218802855229347": {"While reading books, I am able to face myself deeply, and absorb the knowledge from wise man.": ["While reading books, I am able to face myself deeply, and absorb the knowledge from wise man (men or people).", "While reading books, I am able to face myself deeply, and absorb the knowledge from wise men."], "At the same time, I always write down what I thought that to remember my feelings.": ["At the same time, I always write down what I thought that to remember my feelings.", "I always write down what I thought at the same time to remember my feelings."], "Then I realized that my perspective has changed and let me have a mind-broadening.": ["Then I realized that my perspective has changed and let me have a because of this mind-broadening experience.", "Then I realize that my perspective has changed and it lets me experience mind-broadening."], "I’m sure that the more I read books, the more I become be more like myself.": ["I’m sure that the more I read books, the more I become be morelike myself.", "I’m sure that the more I read books, the more I will come to like myself."]}, "175919122433102828503406040261378946979": {"When I speak in Japanese, I care too much about what the others think of me.": ["When I speak in Japanese, I care too much about what theothers think of me."], "That is because our culture need to respect the elderly and speak politely in order to live well in the community.": ["That is because in our culture we need to respect the elderly and speak politely in order to live well in the community."], "Speaking English Has completely changed my life and Lets me more like myself.": ["Speaking English has completely changed my life and lets me be more like myself."]}, "178987358365104073979568696564263925667": {"I have two reasons to explain the difference between Japanese and English.": ["I have two explanations for the differences between Japanese and English.", "I have two reasons to explain the difference between Japanese and English."], "First, grammar is totally different.": ["First, the grammar is totally different.", "First, English grammar is totally different from Japanese."], "English requires to specific subject like I or you.": ["English requires to specify subject like I or you.", "English requires to specify the subject like you or I."], "On the other hand, Japanese often does not require it , which can omit.": ["In Japanese it often is not required, and can be omitted."], "I like the way English’s beautiful and powerful sound and  modulation.": ["I like the beautiful and powerful sound and modulation of English."], "The way I see it, If  I speak English,  I am be able to become more positive.": ["The way I see it, If I speak English, I become more positive.", "Because I see English like this, when I speak English, I can become more positive."], "That’s the things I love English.": ["That’s the things I love of English.", "That’s why I love English."], "Second, pronunciation is completely different.": ["Second, their words are completely different."]}, "128628740473966544949081283236456866956": {"It was nice and sunny day so I did the laundry in the morning.": ["It was a nice and sunny day so I did the laundry in the morning."]}}